---
kind: other
id: Methods.T:Autodesk.Revit.DB.TextElement
source: html/6990b86d-0b65-78c7-e4e6-1686e2ac28ed.htm
---
# TextElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.